using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;

namespace תוכנה_פסיכולוגית
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void button1_Click(object sender, EventArgs e)

        {
            panel2.Visible = true;
            panel2.Location = new System.Drawing.Point(53, 87);
            panel2.Size = new System.Drawing.Size(709, 458);
            if (comboBox1.Text == "פנים עגולות")
            {
                richTextBox1.Text = "אתה אדם חייכן, מלא חיות וחיוניות, חברותי ואופטימי. חוש הומור הינו מרכיב חשוב באישיות שלך ולכן בכל מפגש אתה עשוי להיות במרכז העניינים ולהיות המצחיקן והבדחן שבחבורה. אתה זקוק לחיזוקים, לתשומת לב ולפינוק ולכן אתה עלול להימצא בעצבות ובתחושת התכנסות פנימית ";
                
                label8.Text = "פנים עגולות ";
            }
            if (comboBox1.Text == "פנים מרובעות")
            {
                richTextBox1.Text = " אתה אדם בעלי מזג עצבני משהו. חסרי סבלונות ונוטע להיפגע בקלות. ניחנו בספונטניות ובחוסר סבלנות. רגזנים ונמהרים";
                label8.Text = " פנים מרובעות";
            }
            if (comboBox1.Text == "פנים משולשות")
            {
                richTextBox1.Text = "אתה אדם בעלי מזג נוח , חם, מופנם במידה אך שאפתן ומשיג את רצונך באסרטיביות  ";

                label8.Text = "פנים משולשות  ";
            }
            if (comboBox1.Text == "פנים מאורכות")
            {
                richTextBox1.Text = " אתה אדם בעלי קסם אישי רב , איש שיחה מרתק, עצמאי מאוד , סולדים משגרה חונקת , יצירתי ובעל מעוף. סקרן וחקרן";
                label8.Text = "פנים מאורכות ";
            }
            if (comboBox2.Text == "עיניים קרובות")
            {
                richTextBox1.Text += " בנוסף  אתה עצמאי מאוד ופחות חברותי. רגיש ופגיעה עם נטייה לפסימיות. חסר סבלנות אך אתה מסתיר את זה בחן רב. משדר נינוחות ושלווה אך עלול להתפרץ באגרסיביות רבה";
                label8.Text += " ועיניים קרובות ";
            }
            if (comboBox2.Text == "עיניים בולטות")
            {
                richTextBox1.Text += "בנוסף את איש חמם ורגיש מאוד. חברותי ומלא כריזמה. אתה איש שיחה נפלא עם יכולת שכנוע גבוהה. רעשן ומלא חיים ולכן בכל מקום שבו תמצא טביעה חותם ותדאג להצהיר על נוכחותך. נוטע למצבי רוח משתנים אך אתה נרגע מהר ואינך נוטר טינה ";
                label8.Text += "ועיניים בולטות ";

            }
            if (comboBox2.Text == "עיניים רחוקות")
            {
                richTextBox1.Text += "בנוסף אתה איש קליל הפועל מתוך תחושות בטן. אתה חיי באוירה אופטימית חסרת עכבות . בעל נטייה אומנותית עם כשרון רב ליצירה. סולד ממסגרות ומשתוקקים לחופש ולמרחבים. בעל חוסן נפשי רב ויכולת נתינה רגשית גבוהה מאוד. נאמן ומסור אך זהירות שלא לפגוע בך בשל רגישותך הרבה ";
                label8.Text += " ועיניים רחקות";

            }
            if (comboBox2.Text == "עיניים שקועות")
            {
                richTextBox1.Text += "בנוסף אתה מביעות חולשה נפשית, חוסר בטחון ומופנמות אתה איש רגיש מאוד עם נטייה לפחדים ולחרדות. אתה מתאפיין בחולשה ולא אסרטיבי הנאלץ לקבל בהכנעה את רצון הסביבה. אתה נלחץ בקלות ועלול להימצא במצוקה רגשית . אתה איש טוב וללבי ";
                label8.Text += "ועיניים שקועות";

            }
                 

        }

      

        
    }
}
