using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;

namespace תוכנה_פסיכולוגית
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void button1_Click(object sender, EventArgs e)

        {
            panel2.Visible = true;
            panel2.Location = new System.Drawing.Point(53, 87);
            panel2.Size = new System.Drawing.Size(709, 458);
            if (comboBox1.Text == "פנים עגולות")
            {
                textBox1.Text = "אתה אדם חייכן, מלא חיות וחיוניות, חברותי ואופטימי. חוש הומור הינו מרכיב חשוב באישיות שלך ולכן בכל מפגש אתה עשוי להיות במרכז העניינים ולהיות המצחיקן והבדחן שבחבורה. אתה זקוק לחיזוקים, לתשומת לב ולפינוק ולכן אתה עלול להימצא בעצבות ובתחושת התכנסות פנימית ";
                
                label8.Text = "פנים עגולות ";
            }
            if (comboBox1.Text == "פנים מרובעות")
            {
                textBox1.Text = " אתה אדם בעלי מזג עצבני משהו. חסרי סבלונות ונוטע להיפגע בקלות. ניחנו בספונטניות ובחוסר סבלנות. רגזנים ונמהרים";
                label8.Text = " פנים מרובעות";
            }
            if (comboBox1.Text == "פנים משולשות")
            {
                textBox1.Text = "אתה אדם בעלי מזג נוח , חם, מופנם במידה אך שאפתן ומשיג את רצונך באסרטיביות  ";

                label8.Text = "פנים משולשות  ";
            }
            if (comboBox1.Text == "פנים מאורכות")
            {
                textBox1.Text = " אתה אדם בעלי קסם אישי רב , איש שיחה מרתק, עצמאי מאוד , סולדים משגרה חונקת , יצירתי ובעל מעוף. סקרן וחקרן";
                label8.Text = "פנים מאורכות ";
            }

            ////////////////////////////////////////////////////   עיניים
            if (comboBox2.Text == "עיניים קרובות")
            {
                textBox1.Text += " בנוסף  אתה עצמאי מאוד ופחות חברותי. רגיש ופגיעה עם נטייה לפסימיות. חסר סבלנות אך אתה מסתיר את זה בחן רב. משדר נינוחות ושלווה אך עלול להתפרץ באגרסיביות רבה";
                label8.Text += " ועיניים קרובות ";
            }
            if (comboBox2.Text == "עיניים בולטות")
            {
                textBox1.Text += "בנוסף את איש חמם ורגיש מאוד. חברותי ומלא כריזמה. אתה איש שיחה נפלא עם יכולת שכנוע גבוהה. רעשן ומלא חיים ולכן בכל מקום שבו תמצא טביעה חותם ותדאג להצהיר על נוכחותך. נוטע למצבי רוח משתנים אך אתה נרגע מהר ואינך נוטר טינה ";
                label8.Text += "ועיניים בולטות ";

            }
            if (comboBox2.Text == "עיניים רחוקות")
            {
                textBox1.Text += "בנוסף אתה איש קליל הפועל מתוך תחושות בטן. אתה חיי באוירה אופטימית חסרת עכבות . בעל נטייה אומנותית עם כשרון רב ליצירה. סולד ממסגרות ומשתוקקים לחופש ולמרחבים. בעל חוסן נפשי רב ויכולת נתינה רגשית גבוהה מאוד. נאמן ומסור אך זהירות שלא לפגוע בך בשל רגישותך הרבה ";
                label8.Text += " ועיניים רחקות";

            }
            if (comboBox2.Text == "עיניים שקועות")
            {
                textBox1.Text += "בנוסף אתה מביעות חולשה נפשית, חוסר בטחון ומופנמות אתה איש רגיש מאוד עם נטייה לפחדים ולחרדות. אתה מתאפיין בחולשה ולא אסרטיבי הנאלץ לקבל בהכנעה את רצון הסביבה. אתה נלחץ בקלות ועלול להימצא במצוקה רגשית . אתה איש טוב וללבי ";
                label8.Text += "ועיניים שקועות";

            }
            if (comboBox2.Text == "עיניים גדולות")
            {
                textBox1.Text += "בנוסף אתה איש נהנתן הרודף אחר מנעמי החיים ושרוצים 'לבלוע' את כל העולם. טיפוס אוהבי חברה , דברן ושחצן. רודף הכרה ופרסום. חומרי מאוד ונהנה מתאוות ממון. לרוב כסף מהווה בעבורך מטרה ולא אמצעי. לרוב אתה משדר נינוחות ושביעות רצון מעצמך  ";
                label8.Text += "ועיניים גדולות ";
            }
            if (comboBox2.Text == "עיניים קטנות")
            {
                textBox1.Text += "בנוסף אתה איש חזק עם תעצומות נפשיות גדולות ולפיכך אתה מסוגל להפנים פגיעות נפשיות ולהתמודד עם כאב בקלות יחסית. טיפוס ערמומי ומניפולטיבי וכאשר אתה מסמן מטרה אתה תעשה כמעט הכל על מנת להשיגה. נבון ומבין עניין בקלות רבה, חברותי מאוד, קולחים ומלאי קסם ";
                label8.Text += "ועינים קטנות ";
            }
            ////////////////////////////////////////////////       אף
            if (comboBox3.Text =="אף נישרי")
            {
                textBox1.Text += "בנוסף אתה איש  רגזן וכעסן. חסר בטחון עצמי אך מחפה על כך באגרסיביות ובעקשנות. מבקש להנהיג ולהוביל אך אינך מתפשר על עמדותיהם של אחרים, ולכן אתה נשאר שבויי בחוסר סיפוק מתמיד. מבטא נפלא את האימרה: ' אין הטיפה חוצבת בסלע מכוח העוצמה- אלא מכוח ההתמדה'. קרי, בעיקשותך הרבה ובעמידתך האיתנה על עקרונותיך אתה עשוי להשיג את מבוקשך ";
                label8.Text += "ואף נישרי ";
            }
                if (comboBox3.Text == "אף מורם או סולד")
                {
                    textBox1.Text += "בנוסף אתה מבטא טיפוסי יהירים מתנשאים וגאוותנים מאוד. חומריים ואינם מזוהים עם רוחניות. חיים בתחושה שהכל מגיע לי ומציבים את עצמם מעל הכלל. כריזמטי מאוד ובעלי אישיות ממגנטת. יש המייחסים לבעלי אף סולד תכונות כמו התנשאות. עם זאת, בעלי אף סולד נחשבים מהירי מחשבה וגם זריזים מבחינה גופנית. לכן, מייחסים לבעלי אף סולד מהירות תגובה ולעתים חיפזון ואגרסיביות. יש גם הרואים בבעלי אף סולד טיפוסים ילדותיים ובעלי אגו רגי ";
                    label8.Text += " ואף סולד ";
                }
                if (comboBox3.Text == "  אף מלא ובשרני")
            {
                textBox1.Text += "בנוסף אתה איש נדיב, חם בעל לב רחב. מתאפיין בסולם ערכים גבוה וחיים למען מטרות אידיאליסטיות. בעלי רוח התנדבותית ועשה למען הכלל אך לא שוכח לעשות לבתך. מייצג את האיזון העדין שבין לתת ולקבל ";
                label8.Text += "ואף מלא ובשרני ";
            }
                if (comboBox3.Text == "אף צר")
            {
                textBox1.Text += "בנוסף אתה איש  הנוטע לראות את חצי הכוס הריקה. פסימיות ומלנכוליות הם חלק מהותי במבנה אישיותך. נאמן ומסור עד מאוד. כלפי חוץ אתה משדר חיוניות  וחיוביות אך עמוק פנימה ניכרת בך עצבות ועייפות נפשית. רגיש ,אכפתי ושואף צדק ";
                label8.Text += "אף צר ";
            }
            switch(comboBox4.Text)  ///////////////////// אוזניים
            {
                case "אוזניים זרוקות כלפי מעלה":
                    textBox1.Text += "ף אתה איש כריזמטי ודומיננטי. בטבעך אתה מנהיג בעל כשרון יצירתי ב קסם אישי שופע. אינך מניח לדבר לעמוד בדרך למטרה ומשיג את רצונך לעיתים אף באגרסיביות וכוחנית. שאפתן בעל מוטיבציה בלתי רגילה. לרוב יימצא בעמדות מפתח בכירות עם יכולת השפעה גבוהו   ";
                    label8.Text += "ואוזניים זרוקות כלפי מעלה";
                        break;
                case "אוזניים מעוגלות":
                        textBox1.Text += "בנוסף אתה איש עקשן ודקדקן. בעל עקרונות ברורים ואינך נוטע להתפשר. טיפוס המשדר עוצמה רב עם צורך רב בחופש ומרחב דבר המקשה  על יציבות הזוגיות שלך לאורך זמן. אינך סלחן ולרוב אתה מתעקש עם ביקרות המופנית לעברך  ";
                        label8.Text += "ואוזניים מעוגלות ";
                        break;
                case "אוזניים שמוטות":
                        textBox1.Text += "בנוסף אתה טיפוס עייף. קצת ממורמר ומאוד לא אמביציוזיים. ניראה כאילו מישהו מכריח אותך לנשום כדי להישאר בחיים. כן אתה נוטע מאוד לרחם על עצמך ";
                        label8.Text += "אוזניים שמוטות ";
                        break;
                default:
                        textBox1.Text = "no singal";
                        break;
                         
            }
        }

      

        
    }
}
